# SF Salaries Exercise 

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

** Import pandas as pd.**

In [1]:
import pandas as pd

** Read Salaries.csv as a dataframe called sal.**

In [2]:
sal = pd.read_csv('Salaries.csv')

** Check the head of the DataFrame. **

In [3]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Use the .info() method to find out how many entries there are.**

In [4]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

**What is the average BasePay ?**

In [11]:
sal['BasePay'].mean()

66325.4488404877

** What is the highest amount of OvertimePay in the dataset ? **

In [23]:
sal['OvertimePay'].sort_values(ascending = False)[1]

245131.88

In [75]:
sal['OvertimePay'].max()

245131.88

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [16]:
sal['JobTitle'][sal['EmployeeName'] == 'JOSEPH DRISCOLL']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [76]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

** How much does JOSEPH DRISCOLL make (including benefits)? **

In [18]:
sal['TotalPayBenefits'][sal['EmployeeName'] == 'JOSEPH DRISCOLL']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [77]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

** What is the name of highest paid person (including benefits)?**

In [82]:
sal.sort_values(by = 'TotalPayBenefits', ascending = False).iloc[[0]]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [80]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [86]:
sal.loc[[sal['TotalPayBenefits'].idxmax()]]   # idxmax() is similar numpy argmax()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [87]:
sal.iloc[[sal['TotalPayBenefits'].argmax()]]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [32]:
sal.sort_values(by = 'TotalPayBenefits').iloc[[0]]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [89]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [93]:
sal.loc[[sal['TotalPayBenefits'].idxmin()]]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [95]:
sal.iloc[[sal['TotalPayBenefits'].argmin()]]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [40]:
sal['Year'].unique()

array([2011, 2012, 2013, 2014])

In [113]:
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [116]:
sal.groupby('Year').mean()['BasePay'][[2011, 2013]]

Year
2011    63595.956517
2013    69630.030216
Name: BasePay, dtype: float64

** How many unique job titles are there? **

In [45]:
sal['JobTitle'].nunique()

2159

In [117]:
len(sal['JobTitle'].unique())

2159

** What are the top 5 most common jobs? **

In [48]:
sal['JobTitle'].value_counts()[:5]

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [119]:
sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [120]:
type(sal['JobTitle'].value_counts())

pandas.core.series.Series

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

In [126]:
sal[['JobTitle']][sal['Year'] == 2013].nunique()

JobTitle    1051
dtype: int64

In [128]:
sal[['JobTitle']][sal['Year'] == 2013].value_counts() == 1

JobTitle
Transit Operator                False
Special Nurse                   False
Registered Nurse                False
Public Svc Aide-Public Works    False
Custodian                       False
                                ...
Board Scty, MTA                  True
Special Assistant 16             True
Trnst Power Line Wrk Sprv 2      True
Special Assistant 15             True
Real Estate Devt. Mgr, SFMTA     True
Length: 1051, dtype: bool

In [129]:
sum(sal[['JobTitle']][sal['Year'] == 2013].value_counts() == 1)

202

** How many people have the word Chief in their job title? (This is pretty tricky) **

In [151]:
sum(sal['JobTitle'].apply(str.lower).str.contains('chief'))

627

In [159]:
sal['JobTitle'][sal['JobTitle'].apply(str.lower).str.contains('chief')].value_counts().index

Index(['Assistant Chief Attorney 1', 'Battalion Chief, Fire Suppress',
       'Chief Clerk', 'BATTALION CHIEF, (FIRE DEPARTMENT)',
       'Chief Stationary Engineer', 'Battlion Chief, Fire Suppressi',
       'ASSISTANT CHIEF ATTORNEY I', 'CHIEF STATIONARY ENGINEER, SEWAGE PLANT',
       'Deputy Chief 3', 'Chief Surveyor', 'Assistant Chief Attorney 2',
       'CHIEF CLERK', 'CHIEF STATIONARY ENGINEER',
       'Chief Atty1 (Civil & Criminal)', 'Chief Building Inspector',
       'Assistant Deputy Chief 2', 'Chief Deputy Sheriff',
       'Chief Water Service Inspector', 'CHIEF SURVEYOR',
       'CHIEF ATTORNEY I (CIVIL & CRIMINAL)', 'ASSISTANT DEPUTY CHIEF II',
       'ASSISTANT CHIEF ATTORNEY II', 'Chief Preparator',
       'CHIEF STATIONARY ENGINEER, WATER TREATMENT PLANT',
       'ASSISTANT CHIEF VICTIM/WITNESS INVESTIGATOR',
       'DEPUTY CHIEF III (POLICE DEPARTMENT)', 'Chief Dietitian',
       'ASSISTANT CHIEF DISTRICT ATTORNEY'S INVESTIGATOR',
       'CHIEF PAYROLL AND PERSONNEL CLERK', 'Chief Deputy Adlt Probation Of',
       'CHIEF WATER SERVICE INSPECTOR', 'CHIEF DEPUTY SHERIFF',
       'Chief Electrical Inspector', 'Chief of Police',
       'Emergency Medical Svcs Chief', 'Chief Telephone Operator',
       'Chief, Fire Department', 'Chief Nursery Specialist',
       'CHIEF BUILDING INSPECTOR',
       'DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)',
       'Chief Dep Adlt Prob Of (SFERS)',
       'CONFIDENTIAL CHIEF ATTORNEY II (CIVIL & CRIMINAL)',
       'ASSISTANT CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)',
       'Chief Fire Alarm Dispatcher', 'Chief Housing Inspector',
       'Chief Plumbing Inspector', 'Chief Adult Probation Officer',
       'CHIEF PREPARATOR', 'CHIEF DEPUTY ADULT PROBATION OFFICER',
       'CHIEF ADULT PROBATION OFFICER', 'CHIEF DIETITIAN',
       'CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)',
       'CHIEF VICTIM/WITNESS INVESTIGATOR',
       'CHIEF DISTRICT ATTORNEY'S INVESTIGATOR',
       'ASST. CHIEF, BUREAU OF CLAIMS INVEST. & ADMIN',
       'CHIEF FIRE ALARM DISPATCHER', 'CHIEF TELEPHONE OPERATOR',
       'CHIEF ELECTRICAL INSPECTOR', 'CHIEF NURSERY SPECIALIST',
       'CHIEF OF POLICE', 'CHIEF PLUMBING INSPECTOR',
       'ASST. CHIEF PROBATION OFFICER-JUVENILE PROBATION',
       'Chief Investment Officer', 'CHIEF MICROBIOLOGIST',
       'CHIEF PROBATION OFFICER, JUVENILE COURT', 'CHIEF HOUSING INSPECTOR',
       'Chief Forensic Toxicologist'],
      dtype='object')

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

In [71]:
title_len = sal['JobTitle'].apply(len)

In [72]:
import numpy as np

In [73]:
np.corrcoef(title_len, sal['TotalPayBenefits'])

array([[ 1.        , -0.03687845],
       [-0.03687845,  1.        ]])

In [152]:
sal['title_len'] = sal['JobTitle'].apply(len)

In [161]:
sal[['TotalPayBenefits', 'title_len']].corr('pearson')

                  TotalPayBenefits  title_len
TotalPayBenefits          1.000000  -0.036878
title_len                -0.036878   1.000000

# Great Job!